#+TITLE: Configuracion de emacs.

Credits to Harry R. Schwartz, [[https://github.com/hrs/dotfiles/blob/master/emacs.d/configuration.org][@hrs]],  [[https://github.com/zamansky/using-emacs/blob/master/myinit.org][Zamansky]].
* Informacion personal
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Rafael Leyva Ruiz"
        user-mail-address "rafaelleru95103@gmail.com"
        calendar-latitude 42.2
        calendar-longitude -71.1
        calendar-location-name "Madrid, ES")
#+END_SRC

#+RESULTS:
: Madrid, ES

** Use package 
   #+BEGIN_SRC emacs-lisp
     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
   #+END_SRC

   #+RESULTS:
   | [cl-struct-package-desc diminish (20151215 915) Diminished modes are minor modes with no modeline display nil single melpa nil ((:url . https://github.com/myrjola/diminish.el) (:keywords extensions diminish minor codeprose)) nil] | [cl-struct-package-desc bind-key (20161218 1520) A simple way to manage personal keybindings nil single melpa nil ((:url . https://github.com/jwiegley/use-package) (:keywords keys keybinding config dotemacs)) nil] | [cl-struct-package-desc use-package (20170116 1309) A use-package declaration for simplifying your .emacs ((bind-key (1 0)) (diminish (0 44))) single melpa nil ((:url . https://github.com/jwiegley/use-package) (:keywords dotemacs startup speed config package)) nil] |

** C ++
   #+BEGIN_SRC emacs-lisp

  (defun my-irony-mode-hook ()
    (define-key irony-mode-map [remap completion-at-point]
      'irony-completion-at-point-async)
    (define-key irony-mode-map [remap complete-symbol]
      'irony-completion-at-point-async)
    (require 'auto-complete-clang))
  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
  (eval-after-load 'company
    '(add-to-list 'company-backends 'company-irony))

  (add-hook 'irony-mode-hook 'company-irony-setup-begin-commands)
   #+END_SRC

   #+RESULTS:
   | company-irony-setup-begin-commands | irony-cdb-autosetup-compile-options | my-irony-mode-hook |

   #+BEGIN_SRC emacs-lisp
     (add-hook 'c++-mode-hook 'irony-mode)
     (add-hook 'c-mode-hook 'irony-mode)
     (add-hook 'objc-mode-hook 'irony-mode)

     ;; replace the `completion-at-point' and `complete-symbol' bindings in
     ;; irony-mode's buffers by irony-mode's function
     (defun my-irony-mode-hook ()
       (define-key irony-mode-map [remap completion-at-point]
         'irony-completion-at-point-async)
       (define-key irony-mode-map [remap complete-symbol]
         'irony-completion-at-point-async))
     (add-hook 'irony-mode-hook 'my-irony-mode-hook)
     (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
   #+END_SRC

   #+RESULTS:
   | company-irony-setup-begin-commands | irony-cdb-autosetup-compile-options | my-irony-mode-hook |

** Autorevertmode en buffers de rogmode
   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook 'auto-revert-mode 1)
   #+END_SRC

   #+RESULTS:
   | (lambda nil (org-bullets-mode t)) | er/add-org-mode-expansions | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ac/setup-current-buffer | auto-revert-mode |

*** La agenda se carga desde el index
   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files (list org-index-file
   			       "~/org/gcal.org"))
   #+END_SRC

   #+RESULTS:
   | ~/org/index.org | ~/org/gcal.org |

**** TODO completar descripcion de los templates.
    #+BEGIN_SRC emacs-lisp
      (setq org-capture-templates
      '(("i" "Idea"
         entry
         (file (org-file-path "idea.org")
                 "* IDEA %?\n"))

        ("r" "To read item"
         checkitem
         (file+datetree (org-file-path "to-read.org"))
         " [ ] %? ")

        ("b" "Item to buy"
         entry
         (file+datetree "buylist.org")
         "* BUY %?")

         ("t" "Todo"
              entry
              (file+headline org-index-file "TASKS")
              "* TODO %?\n  ADDED:%T")

         ("u" "UGR Todo"
              entry
              (file+headline org-index-file "UGR")
              "* TODO %? %^g:UGR:\nADDED:%T")

         ("e" "Nuevo evento"
              entry
              (file "~/org/gcal.org")
          "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
         ))
     #+END_SRC

	  #+RESULTS:
	  | i | Idea | entry | (file (org-file-path idea.org) * IDEA %? |

**** hooks ppara la agenda:
     #+BEGIN_SRC emacs-lisp
       ;(add-hook 'after-init-hook (lambda () (org-gcal-sync) ))
       (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
       (add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
     #+END_SRC

     #+RESULTS:
     | lambda | nil | (org-gcal-sync) |

** funcion para actualizar el indice de cosas que leer en el navegador
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; Auto-export org files to html when saved 
     (defun org-mode-export-hook()
       "Auto export html"
       (when (eq major-mode 'org-mode)
         (when (eq buffer-file-name "/home/rafa/org/to-read.org"))
          (org-twbs-export-to-html t)))

     (add-hook 'after-save-hook 'org-mode-export-hook)
   #+END_SRC

   #+RESULTS:
   | org-mode-export-hook |

* Desactivo las flechas para no usarlas, que para algo tiene emacs tantos atajos
  #+BEGIN_SRC emacs-lisp
    (defun disable-arrow-keys ()
    (interactive)
        ;;;Desactiva la nevagacion con las flechas
    (global-unset-key (kbd "<left>"))
    (global-unset-key (kbd "<right>"))
    (global-unset-key (kbd "<up>"))
    (global-unset-key (kbd "<down>")))


    (defun enable-arrow-keys ()
    (interactive)
        ;;;Activa la navegacion con flecha
     (global-set-key (kbd "<left>") 'left-char)
     (global-set-key (kbd "<right>")  'right-char)
     (global-set-key (kbd "<up>") 'previous-line)
     (global-set-key (kbd "<down>") 'next-line))

    ;(disable-arrow-keys) He conseguido no usar las flechas al fin.
  #+END_SRC

  #+RESULTS:
  : enable-arrow-keys

  #+BEGIN_SRC emacs-lisp
    (add-hook 'term-mode-hook
  	    (lambda ()
  	      (local-set-key (kbd "C-c C-k") 'kill-buffer-this-buffer)))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (local-set-key (kbd C-c C-k) (quote kill-buffer-this-buffer)) |

** Para cargar el tema personalizado en cada frame que creemos
   #+BEGIN_SRC emacs-lisp
     (add-hook 'after-make-frame-functions
               (lambda (frame)
                 (select-frame frame)
                 (load-my-theme)
   	      (set-font)))
   #+END_SRC

   #+RESULTS:
   | (lambda (frame) (select-frame frame) (load-my-theme) (set-font)) | x-dnd-init-frame |
